# -*- coding: utf-8 -*-
import pandas as pd
import json
from util import *
from collections import defaultdict
modernGPT = r"./models/modern_GPT2"
ancientGPT = r"./models/tradition_GPT2"
tfidf_model = r"./models/tfidf_model.pkl"


ancient_modern_words = ["行李", "微", "东面", "面目", "至于", "大方", "足下", "怀抱", "随化", "纵情", "见机", "猖狂", "学者", "从而", "众人", "不必", "所以", "用心", "尘埃", "气候", "经营", "可怜", "方丈", "往往", "颜色", "首领", "非常", "当道", "不行", "成立", "洗马", "上报", "告诉", "区区", "辛苦", "侥幸", "不许", "听", "东面", "其次", "春秋", "品类", "所以", "夫人", "俯仰", "无功", "布衣", "不过", "以往", "因而", "前进", "非常", "亲戚", "君", "鱼肉", "斯文", "宣言", "竟", "东道主", "美人", "约束", "海运", "左右", "婚姻", "指示", "细说", "故事", "然后", "至于", "智力", "速", "其实", "老大", "恨", "私心", "下流", "无聊", "口舌", "慷慨", "风流", "形容", "叹息", "向前", "淹", "首领", "行为", "私人", "态度", "风骚", "偏僻", "尴尬", "虽然", "果然", "众人", "虫", "羊角", "小年", "大年", "野马", "以为", "秀才", "根本", "夫人", "奔驰", "郎中", "成立", "穷", "一介", "弱冠", "再", "云尔", "学士", "傲物", "山东", "河北", "河南", "于是", "向来", "河内", "无望", "养生", "可以", "三岁", "代序", "茫然", "峥嵘", "明年", "因为", "突出", "无绪", "风情", "百年", "可怜", "走", "落", "钩心斗角", "视", "举", "率", "祖父", "牛马走", "勤勤恳恳", "意气", "妻子", "非常", "居室", "几何", "依依", "苦恨", "信", "灭", "拔", "等闲", "颜色", "整顿", "大江", "草草", "赢得", "次第", "了得", "博学", "爪牙", "寄托", "黄泉", "金", "小学", "无", "白露", "斗牛", "平方", "童子", "师旅", "以及", "至于", "中国", "从而", "天理", "固然", "难为", "行为", "越国", "福利", "模拟", "童子", "户口", "聪明", "区区", "上报", "可怜", "窃", "从容" ]
classical_chinese_particles = {"而":8,"乎":3,"其":12,"且":7,"所":6,"为":16,"焉":8,"也":3,"以":16,"因":11,"于":6,"与":8,"则":14,"者":9,"之":12}
classical_chinese_realwords = {"爱":6,"安":7,"被":5,"倍":6,"本":7,"鄙":4,"兵":4,"病":6,"伯":6,"曾":3,"察":5,"长":6,"朝":5,"乘":6,"城":2,"诚":3,"池":2,"除":4,"传":5,"辞":6,"从":6,"达":6,"怠":3,"殆":4,"当":8,"道":8,"得":3,"度":7,"短":4,"多":4,"发":11,"方":8,"非":5,"复":9,"负":8,"盖":10,"鼓":5,"故":11,"顾":9,"固":9,"归":3,"国":5,"过":6,"何":8,"恨":4,"后":6,"胡":3,"患":7,"或":5,"疾":7,"及":7,"即":8,"既":7,"假":6,"间":15,"见":8,"解":9,"进":3,"尽":8,"就":7,"举":7,"绝":8,"堪":4,"克":7,"类":6,"怜":6,"临":4,"弥":4,"名":2,"末":5,"莫":6,"乃":7,"内":6,"判":5,"期":6,"奇":8,"迁":4,"请":8,"穷":8,"求":2,"去":8,"劝":3,"却":7,"如":5,"若":5,"善":9,"稍":3,"少":6,"涉":4,"胜":5,"识":3,"使":8,"是":5,"适":7,"书":7,"孰":5,"属":7,"数":7,"遂":6,"率":12,"说":5,"私":3,"素":6,"汤":5,"涕":4,"通":8,"徒":7,"图":7,"退":5,"亡":6,"王":4,"望":5,"恶":3,"微":6,"闻":5,"相":6,"谢":6,"悉":5,"信":9,"兴":3,"行":9,"幸":3,"修":7,"徐":2,"许":4,"阳":5,"要":10,"宜":3,"遗":5,"贻":2,"易":5,"阴":7,"引":3,"右":6,"逾":2,"狱":3,"再":2,"造":6,"知":9,"置":5,"致":8,"质":7,"治":8,"诸":3,"贼":7,"族":4,"卒":4,"走":6,"左":5,"坐":7}

big_dict = pd.read_csv('./tables/汉语大词典_义项表.tsv', sep='\t')
big_meaning_dict = big_dict['token'].value_counts().to_dict()

# 四库全书语料库统计的单字频率排行
word_fre_dict = json.load(open('./tables/AncientChineseCharacterFrequency.json', 'r', encoding='utf-16-le'))
bigram_fre_dict = json.load(open('./tables/AncientChineseBigramFrequency.json', 'r', encoding='utf-16-le'))


if __name__ == '__main__':
    print(classical_chinese_realwords.keys())
    print(len(ancient_modern_words))
    print(classical_chinese_particles.keys() )
    print(len(big_meaning_dict))
    print(len(word_fre_dict))
    print(len(bigram_fre_dict))
    print(len(extract_fre_dict(word_fre_dict, 0, 1000)))
    print('古今异义单字词个数：', len([word for word in ancient_modern_words if len(word)==1]))
    print('古今异义双字词个数:', len([word for word in ancient_modern_words if len(word)==2]))
